In [1]:
import pandas as pd
import datetime as dt
import numpy as np

In [2]:
# Create import paths

sales_path="Resources/sales-data-set.csv"
stores_path="Resources/stores-data-set.csv"

In [3]:
# Read Stores data

stores_df = pd.read_csv(stores_path)
stores_df.head()

   Store Type    Size
0      1    A  151315
1      2    A  202307
2      3    B   37392
3      4    A  205863
4      5    B   34875

In [4]:
# Read Sales data

sales_df = pd.read_csv(sales_path)
sales_df.head()

   Store  Dept        Date  Weekly_Sales  IsHoliday
0      1     1  05/02/2010      24924.50      False
1      1     1  12/02/2010      46039.49       True
2      1     1  19/02/2010      41595.55      False
3      1     1  26/02/2010      19403.54      False
4      1     1  05/03/2010      21827.90      False

In [5]:
# Get dtypes

sales_df.dtypes

Store             int64
Dept              int64
Date             object
Weekly_Sales    float64
IsHoliday          bool
dtype: object

In [6]:
# Convert Date to Datetime object

sales_df["Date"] = pd.to_datetime(sales_df["Date"])
sales_df.sort_values(by=["Store"], inplace=True)
sales_df

        Store  Dept       Date  Weekly_Sales  IsHoliday
0           1     1 2010-05-02      24924.50      False
6825        1    56 2010-10-15       1555.96      False
6826        1    56 2010-10-22       1452.08      False
6827        1    56 2010-10-29       1395.02      False
6828        1    56 2010-05-11       1089.72      False
...       ...   ...        ...           ...        ...
415146     45    24 2011-07-10       7858.31      False
415147     45    24 2011-10-14       3573.52      False
415148     45    24 2011-10-21       6275.41      False
415150     45    24 2011-04-11       7457.26      False
421569     45    98 2012-10-26       1076.80      False

[421570 rows x 5 columns]

In [7]:
# Drop Department and IsHoliday columns

sales_df = sales_df.drop(["Dept", "IsHoliday"], axis=1)
sales_df

        Store       Date  Weekly_Sales
0           1 2010-05-02      24924.50
6825        1 2010-10-15       1555.96
6826        1 2010-10-22       1452.08
6827        1 2010-10-29       1395.02
6828        1 2010-05-11       1089.72
...       ...        ...           ...
415146     45 2011-07-10       7858.31
415147     45 2011-10-14       3573.52
415148     45 2011-10-21       6275.41
415150     45 2011-04-11       7457.26
421569     45 2012-10-26       1076.80

[421570 rows x 3 columns]

In [8]:
# Re-sort the DF

sales_df = sales_df.sort_values(["Store", "Date"], ignore_index=True)
sales_df

        Store       Date  Weekly_Sales
0           1 2010-01-10       2054.05
1           1 2010-01-10        743.00
2           1 2010-01-10        116.00
3           1 2010-01-10      10911.03
4           1 2010-01-10       3300.65
...       ...        ...           ...
421565     45 2012-12-10       3298.95
421566     45 2012-12-10       7627.72
421567     45 2012-12-10      10457.53
421568     45 2012-12-10      22700.10
421569     45 2012-12-10       8004.28

[421570 rows x 3 columns]

In [9]:
sales_grouped = sales_df.groupby(sales_df.Store).count()
sales_grouped

        Date  Weekly_Sales
Store
1      10244         10244
2      10238         10238
3       9036          9036
4      10272         10272
5       8999          8999
6      10211         10211
7       9762          9762
8       9895          9895
9       8867          8867
10     10315         10315
11     10062         10062
12      9705          9705
13     10474         10474
14     10040         10040
15      9901          9901
16      9443          9443
17      9864          9864
18      9859          9859
19     10148         10148
20     10214         10214
21      9582          9582
22      9688          9688
23     10050         10050
24     10228         10228
25      9804          9804
26      9854          9854
27     10225         10225
28     10113         10113
29      9455          9455
30      7156          7156
31     10142         10142
32     10202         10202
33      6487          6487
34     10224         10224
35      9528          9528
36      6222          6222
37      7206          7206
38      7362          7362
39      9878          9878
40     10017         10017
41     10088         10088
42      6953          6953
43      6751          6751
44      7169          7169
45      9637          9637

In [11]:
store_dict = {}

weekly_date = []
weekly_sales = []

for i in range(1, 50):
    
    store_id = sales_df.iloc[i,0]
    if not store_dict.get(store_id): 
        store_dict[store_id] = []
        
    store_dict[store_id].append((sales_df.iloc[i,1], sales_df.iloc[i,2]))
            
print(store_dict)

{1: [(Timestamp('2010-01-10 00:00:00'), 743.0), (Timestamp('2010-01-10 00:00:00'), 116.0), (Timestamp('2010-01-10 00:00:00'), 10911.03), (Timestamp('2010-01-10 00:00:00'), 3300.65), (Timestamp('2010-01-10 00:00:00'), 5652.94), (Timestamp('2010-01-10 00:00:00'), 2644.46), (Timestamp('2010-01-10 00:00:00'), 574.77), (Timestamp('2010-01-10 00:00:00'), 1029.6), (Timestamp('2010-01-10 00:00:00'), 7578.6), (Timestamp('2010-01-10 00:00:00'), 4484.02), (Timestamp('2010-01-10 00:00:00'), 112126.81), (Timestamp('2010-01-10 00:00:00'), 1521.0), (Timestamp('2010-01-10 00:00:00'), 58625.28), (Timestamp('2010-01-10 00:00:00'), 8377.12), (Timestamp('2010-01-10 00:00:00'), 666.0), (Timestamp('2010-01-10 00:00:00'), 11.12), (Timestamp('2010-01-10 00:00:00'), 22.94), (Timestamp('2010-01-10 00:00:00'), 17058.26), (Timestamp('2010-01-10 00:00:00'), 58034.24), (Timestamp('2010-01-10 00:00:00'), 56157.83), (Timestamp('2010-01-10 00:00:00'), 57022.45), (Timestamp('2010-01-10 00:00:00'), 73315.81), (Timestamp('2010-01-10 00:00:00'), 118966.9), (Timestamp('2010-01-10 00:00:00'), 32954.82), (Timestamp('2010-01-10 00:00:00'), 10344.16), (Timestamp('2010-01-10 00:00:00'), 113009.41), (Timestamp('2010-01-10 00:00:00'), 27930.71), (Timestamp('2010-01-10 00:00:00'), 15460.88), (Timestamp('2010-01-10 00:00:00'), 28460.62), (Timestamp('2010-01-10 00:00:00'), 10672.47), (Timestamp('2010-01-10 00:00:00'), 31074.81), (Timestamp('2010-01-10 00:00:00'), 3422.19), (Timestamp('2010-01-10 00:00:00'), 46866.41), (Timestamp('2010-01-10 00:00:00'), 20110.05), (Timestamp('2010-01-10 00:00:00'), 4471.0), (Timestamp('2010-01-10 00:00:00'), 39017.88), (Timestamp('2010-01-10 00:00:00'), 40474.22), (Timestamp('2010-01-10 00:00:00'), 9759.85), (Timestamp('2010-01-10 00:00:00'), 12943.86), (Timestamp('2010-01-10 00:00:00'), 29764.24), (Timestamp('2010-01-10 00:00:00'), 16227.08), (Timestamp('2010-01-10 00:00:00'), 3389.42), (Timestamp('2010-01-10 00:00:00'), 1583.2), (Timestamp('2010-01-10 00:00:00'), 16248.15), (Timestamp('2010-01-10 00:00:00'), 8648.02), (Timestamp('2010-01-10 00:00:00'), 34912.45), (Timestamp('2010-01-10 00:00:00'), 9775.17), (Timestamp('2010-01-10 00:00:00'), 23381.38), (Timestamp('2010-01-10 00:00:00'), 20094.19)]}

In [ ]:
date_list = list(sales_df["Date"].unique())
date_list = np.ravel(date_list)
date_list[0]

In [ ]:
for row in sales_df:
    if sales_df["Store"].values == 1:
        print(foo)

In [ ]:
for i in range(1, 10):
    weekly_sales = []
    if sales_df.loc[sales_df["Store"].values == 1]:
        #weekly_sales.append(sales_df.loc[:, sales_df["Weekly_Sales"]])
        print(sales_df.Weekly_Sales)

In [ ]:
# Get sales info

weekly_sales = []

for i in range(2, len(sales_df)):
    this_date = sales_df.loc[i, sales_df.Date]
    last_date = sales_df.loc[i-1, sales_df.Date]
    sales_list = []
    
    while this_date == last_date:
        sales_list.append(sales_df.Weekly_Sales)
        
    else:
        sales_dict = {sales_df.Date : sales_list}
        weekly_sales.append(sales_dict)
        
print(weekly_sales)

In [ ]:
# Find values for store 1

store_1 = sales_df.loc[sales_df["Store"] == 1]
store_1_grouped = store_1.groupby(store_1.Date).sum()
store_1_grouped = store_1_grouped.drop(["Store"], axis=1)
store_1 = store_1_grouped.rename(columns = {"Weekly_Sales": "Store_1_Sales"})
store_1

In [ ]:
# Build a function to do this for the rest

def store_sales(x):
    store_x = sales_df.loc[sales_df["Store"] == x]
    store_x_grouped = store_x.groupby(store_x.Date).sum()
    store_x_grouped = store_x_grouped.drop(["Store"], axis=1)
    store_x = store_x_grouped.rename(columns = {"Weekly_Sales": "Store_x_Sales"})
    print(f'store {x}')

In [ ]:
# Write the for loop

x = range(1, 46)

for x in x:
    store_sales(x)

In [ ]:
store_15

In [ ]:
# Find values for store 2

store_2 = sales_df.loc[sales_df["Store"] == 2]
store_2_grouped = store_2.groupby(store_2.Date).sum()
store_2_grouped = store_2_grouped.drop(["Store"], axis=1)
store_2 = store_2_grouped.rename(columns = {"Weekly_Sales": "Store_2_Sales"})
store_2

In [ ]:
# Find values for store 3

store_3 = sales_df.loc[sales_df["Store"] == 3]
store_3_grouped = store_3.groupby(store_3.Date).sum()
store_3_grouped = store_3_grouped.drop(["Store"], axis=1)
store_3 = store_3_grouped.rename(columns = {"Weekly_Sales": "Store_3_Sales"})
store_3

In [ ]:
# Find values for store 4

store_4 = sales_df.loc[sales_df["Store"] == 4]
store_4_grouped = store_4.groupby(store_4.Date).sum()
store_4_grouped = store_4_grouped.drop(["Store"], axis=1)
store_4 = store_4_grouped.rename(columns = {"Weekly_Sales": "Store_4_Sales"})
store_4

In [ ]:
# Find values for store 5

store_5 = sales_df.loc[sales_df["Store"] == 5]
store_5_grouped = store_5.groupby(store_5.Date).sum()
store_5_grouped = store_5_grouped.drop(["Store"], axis=1)
store_5 = store_5_grouped.rename(columns = {"Weekly_Sales": "Store_5_Sales"})
store_5

In [ ]:
# Find values for store 5

store_6 = sales_df.loc[sales_df["Store"] == 6]
store_6_grouped = store_6.groupby(store_6.Date).sum()
store_6_grouped = store_6_grouped.drop(["Store"], axis=1)
store_6 = store_6_grouped.rename(columns = {"Weekly_Sales": "Store_6_Sales"})
store_6